OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1779.h
extern __at(0x049A) __sfr T8TMR;
extern __at(0x049A) __sfr TMR8;
extern __at(0x049B) __sfr PR8;
extern __at(0x049B) __sfr T8PR;

//==============================================================================
//        T8CON Bits

extern __at(0x049C) __sfr T8CON;

typedef union
  {
  struct
    {
    unsigned OUTPS0             : 1;
    unsigned OUTPS1             : 1;
    unsigned OUTPS2             : 1;
    unsigned OUTPS3             : 1;
    unsigned CKPS0              : 1;
    unsigned CKPS1              : 1;
    unsigned CKPS2              : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned T8OUTPS0           : 1;
    unsigned T8OUTPS1           : 1;
    unsigned T8OUTPS2           : 1;
    unsigned T8OUTPS3           : 1;
    unsigned T8CKPS0            : 1;
    unsigned T8CKPS1            : 1;
    unsigned T8CKPS2            : 1;
    unsigned T8ON               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TMR8ON             : 1;
    };

  struct
    {
    unsigned OUTPS              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned T8OUTPS            : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CKPS               : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T8CKPS             : 3;
    unsigned                    : 1;
    };
  } __T8CONbits_t;

extern __at(0x049C) volatile __T8CONbits_t T8CONbits;

#define _T8CON_OUTPS0           0x01
#define _T8CON_T8OUTPS0         0x01
#define _T8CON_OUTPS1           0x02
#define _T8CON_T8OUTPS1         0x02
#define _T8CON_OUTPS2           0x04
#define _T8CON_T8OUTPS2         0x04
#define _T8CON_OUTPS3           0x08
#define _T8CON_T8OUTPS3         0x08
#define _T8CON_CKPS0            0x10
#define _T8CON_T8CKPS0          0x10
#define _T8CON_CKPS1            0x20
#define _T8CON_T8CKPS1          0x20
#define _T8CON_CKPS2            0x40
#define _T8CON_T8CKPS2          0x40
#define _T8CON_ON               0x80
#define _T8CON_T8ON             0x80
#define _T8CON_TMR8ON           0x80

//==============================================================================


//==============================================================================
//        T8HLT Bits

extern __at(0x049D) __sfr T8HLT;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE2              : 1;
    unsigned MODE3              : 1;
    unsigned MODE4              : 1;
    unsigned CKSYNC             : 1;
    unsigned CKPOL              : 1;
    unsigned PSYNC              : 1;
    };

  struct
    {
    unsigned T8MODE0            : 1;
    unsigned T8MODE1            : 1;
    unsigned T8MODE2            : 1;
    unsigned T8MODE3            : 1;
    unsigned T8MODE4            : 1;
    unsigned T8CKSYNC           : 1;
    unsigned T8CKPOL            : 1;
    unsigned T8PSYNC            : 1;
    };

  struct
    {
    unsigned MODE               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned T8MODE             : 5;
    unsigned                    : 3;
    };
  } __T8HLTbits_t;

extern __at(0x049D) volatile __T8HLTbits_t T8HLTbits;

#define _T8HLT_MODE0            0x01
#define _T8HLT_T8MODE0          0x01
#define _T8HLT_MODE1            0x02
#define _T8HLT_T8MODE1          0x02
#define _T8HLT_MODE2            0x04
#define _T8HLT_T8MODE2          0x04
#define _T8HLT_MODE3            0x08
#define _T8HLT_T8MODE3          0x08
#define _T8HLT_MODE4            0x10
#define _T8HLT_T8MODE4          0x10
#define _T8HLT_CKSYNC           0x20
#define _T8HLT_T8CKSYNC         0x20
#define _T8HLT_CKPOL            0x40
#define _T8HLT_T8CKPOL          0x40
#define _T8HLT_PSYNC            0x80
#define _T8HLT_T8PSYNC          0x80

//==============================================================================


//==============================================================================
//        T8CLKCON Bits

extern __at(0x049E) __sfr T8CLKCON;

typedef union
  {
  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned CS2                : 1;
    unsigned CS3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T8CS0              : 1;
    unsigned T8CS1              : 1;
    unsigned T8CS2              : 1;
    unsigned T8CS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS                 : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned T8CS               : 4;
    unsigned                    : 4;
    };
  } __T8CLKCONbits_t;

extern __at(0x049E) volatile __T8CLKCONbits_t T8CLKCONbits;

#define _T8CLKCON_CS0           0x01
#define _T8CLKCON_T8CS0         0x01
#define _T8CLKCON_CS1           0x02
#define _T8CLKCON_T8CS1         0x02
#define _T8CLKCON_CS2           0x04
#define _T8CLKCON_T8CS2         0x04
#define _T8CLKCON_CS3           0x08
#define _T8CLKCON_T8CS3         0x08

//==============================================================================


//==============================================================================
//        T8RST Bits

extern __at(0x049F) __sfr T8RST;

typedef union
  {
  struct
    {
    unsigned RSEL0              : 1;
    unsigned RSEL1              : 1;
    unsigned RSEL2              : 1;
    unsigned RSEL3              : 1;
    unsigned RSEL4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T8RSEL0            : 1;
    unsigned T8RSEL1            : 1;
    unsigned T8RSEL2            : 1;
    unsigned T8RSEL3            : 1;
    unsigned T8RSEL4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RSEL               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned T8RSEL             : 5;
    unsigned                    : 3;
    };
  } __T8RSTbits_t;

extern __at(0x049F) volatile __T8RSTbits_t T8RSTbits;

#define _T8RST_RSEL0            0x01
#define _T8RST_T8RSEL0          0x01
#define _T8RST_RSEL1            0x02
#define _T8RST_T8RSEL1          0x02
#define _T8RST_RSEL2            0x04
#define _T8RST_T8RSEL2          0x04
#define _T8RST_RSEL3            0x08
#define _T8RST_T8RSEL3          0x08
#define _T8RST_RSEL4            0x10
#define _T8RST_T8RSEL4          0x10

//==============================================================================

extern __at(0x050F) __sfr OPA1NCHS;
extern __at(0x0510) __sfr OPA1PCHS;

//==============================================================================
//        OPA1CON Bits

extern __at(0x0511) __sfr OPA1CON;

typedef union
  {
  struct
    {
    unsigned ORM0               : 1;
    unsigned ORM1               : 1;
    unsigned ORPOL              : 1;
    unsigned                    : 1;
    unsigned UG                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned OPA1ORM0           : 1;
    unsigned OPA1ORM1           : 1;
    unsigned OPA1ORPOL          : 1;
    unsigned                    : 1;
    unsigned OPA1UG             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPA1EN             : 1;
    };

  struct
    {
    unsigned OPA1ORM            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned ORM                : 2;
    unsigned                    : 6;
    };
  } __OPA1CONbits_t;

extern __at(0x0511) volatile __OPA1CONbits_t OPA1CONbits;

#define _OPA1CON_ORM0           0x01
#define _OPA1CON_OPA1ORM0       0x01
#define _OPA1CON_ORM1           0x02
#define _OPA1CON_OPA1ORM1       0x02
#define _OPA1CON_ORPOL          0x04
#define _OPA1CON_OPA1ORPOL      0x04
#define _OPA1CON_UG             0x10
#define _OPA1CON_OPA1UG         0x10
#define _OPA1CON_EN             0x80
#define _OPA1CON_OPA1EN         0x80

//==============================================================================

extern __at(0x0512) __sfr OPA1ORS;
extern __at(0x0513) __sfr OPA2NCHS;
extern __at(0x0514) __sfr OPA2PCHS;

//==============================================================================
//        OPA2CON Bits

extern __at(0x0515) __sfr OPA2CON;

typedef union
  {
  struct
    {
    unsigned ORM0               : 1;
    unsigned ORM1               : 1;
    unsigned ORPOL              : 1;
    unsigned                    : 1;
    unsigned UG                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned OPA2ORM0           : 1;
    unsigned OPA2ORM1           : 1;
    unsigned OPA2ORPOL          : 1;
    unsigned                    : 1;
    unsigned OPA2UG             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPA2EN             : 1;
    };

  struct
    {
    unsigned ORM                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned OPA2ORM            : 2;
    unsigned                    : 6;
    };
  } __OPA2CONbits_t;

extern __at(0x0515) volatile __OPA2CONbits_t OPA2CONbits;

#define _OPA2CON_ORM0           0x01
#define _OPA2CON_OPA2ORM0       0x01
#define _OPA2CON_ORM1           0x02
#define _OPA2CON_OPA2ORM1       0x02
#define _OPA2CON_ORPOL          0x04
#define _OPA2CON_OPA2ORPOL      0x04
#define _OPA2CON_UG             0x10
#define _OPA2CON_OPA2UG         0x10
#define _OPA2CON_EN             0x80
#define _OPA2CON_OPA2EN         0x80

//==============================================================================

extern __at(0x0516) __sfr OPA2ORS;
extern __at(0x0517) __sfr OPA3NCHS;
extern __at(0x0518) __sfr OPA3PCHS;

//==============================================================================
//        OPA3CON Bits

extern __at(0x0519) __sfr OPA3CON;

typedef union
  {
  struct
    {
    unsigned ORM0               : 1;
    unsigned ORM1               : 1;
    unsigned ORPOL              : 1;
    unsigned                    : 1;
    unsigned UG                 : 1;
    unsigned                    : 1;
    unsigned SP                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned OPA3ORM0           : 1;
    unsigned OPA3ORM1           : 1;
    unsigned OPA3ORPOL          : 1;
    unsigned                    : 1;
    unsigned OPA3UG             : 1;
    unsigned                    : 1;
    unsigned OPA3SP             : 1;
    unsigned OPA3EN             : 1;
    };

  struct
    {
    unsigned ORM                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned OPA3ORM            : 2;
    unsigned                    : 6;
    };
  } __OPA3CONbits_t;

extern __at(0x0519) volatile __OPA3CONbits_t OPA3CONbits;

#define _OPA3CON_ORM0           0x01
#define _OPA3CON_OPA3ORM0       0x01
#define _OPA3CON_ORM1           0x02
#define _OPA3CON_OPA3ORM1       0x02
#define _OPA3CON_ORPOL          0x04
#define _OPA3CON_OPA3ORPOL      0x04
#define _OPA3CON_UG             0x10
#define _OPA3CON_OPA3UG         0x10
#define _OPA3CON_SP             0x40
#define _OPA3CON_OPA3SP         0x40
#define _OPA3CON_EN             0x80
#define _OPA3CON_OPA3EN         0x80

//==============================================================================

extern __at(0x051A) __sfr OPA3ORS;
extern __at(0x051B) __sfr OPA4NCHS;
extern __at(0x051C) __sfr OPA4PCHS;

//==============================================================================
//        OPA4CON Bits

extern __at(0x051D) __sfr OPA4CON;

typedef union
  {
  struct
    {
    unsigned ORM0               : 1;
    unsigned ORM1               : 1;
    unsigned ORPOL              : 1;
    unsigned                    : 1;
    unsigned UG                 : 1;
    unsigned                    : 1;
    unsigned SP                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned OPA4ORM0           : 1;
    unsigned OPA4ORM1           : 1;
    unsigned OPA4ORPOL          : 1;
    unsigned                    : 1;
    unsigned OPA4UG             : 1;
    unsigned                    : 1;
    unsigned OPA4SP             : 1;
    unsigned OPA4EN             : 1;
    };

  struct
    {
    unsigned OPA4ORM            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned ORM                : 2;
    unsigned                    : 6;
    };
  } __OPA4CONbits_t;

