OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1779.h
#define _DAC5CON2_REF8          0x01
#define _DAC5CON2_DAC5REF8      0x01
#define _DAC5CON2_R8            0x01
#define _DAC5CON2_DAC5R8        0x01
#define _DAC5CON2_REF9          0x02
#define _DAC5CON2_DAC5REF9      0x02
#define _DAC5CON2_R9            0x02
#define _DAC5CON2_DAC5R9        0x02
#define _DAC5CON2_REF10         0x04
#define _DAC5CON2_DAC5REF10     0x04
#define _DAC5CON2_R10           0x04
#define _DAC5CON2_DAC5R10       0x04
#define _DAC5CON2_REF11         0x08
#define _DAC5CON2_DAC5REF11     0x08
#define _DAC5CON2_R11           0x08
#define _DAC5CON2_DAC5R11       0x08
#define _DAC5CON2_REF12         0x10
#define _DAC5CON2_DAC5REF12     0x10
#define _DAC5CON2_R12           0x10
#define _DAC5CON2_DAC5R12       0x10
#define _DAC5CON2_REF13         0x20
#define _DAC5CON2_DAC5REF13     0x20
#define _DAC5CON2_R13           0x20
#define _DAC5CON2_DAC5R13       0x20
#define _DAC5CON2_REF14         0x40
#define _DAC5CON2_DAC5REF14     0x40
#define _DAC5CON2_R14           0x40
#define _DAC5CON2_DAC5R14       0x40
#define _DAC5CON2_REF15         0x80
#define _DAC5CON2_DAC5REF15     0x80
#define _DAC5CON2_R15           0x80
#define _DAC5CON2_DAC5R15       0x80

//==============================================================================


//==============================================================================
//        DAC5REFH Bits

extern __at(0x059A) __sfr DAC5REFH;

typedef union
  {
  struct
    {
    unsigned REF8               : 1;
    unsigned REF9               : 1;
    unsigned REF10              : 1;
    unsigned REF11              : 1;
    unsigned REF12              : 1;
    unsigned REF13              : 1;
    unsigned REF14              : 1;
    unsigned REF15              : 1;
    };

  struct
    {
    unsigned DAC5REF8           : 1;
    unsigned DAC5REF9           : 1;
    unsigned DAC5REF10          : 1;
    unsigned DAC5REF11          : 1;
    unsigned DAC5REF12          : 1;
    unsigned DAC5REF13          : 1;
    unsigned DAC5REF14          : 1;
    unsigned DAC5REF15          : 1;
    };

  struct
    {
    unsigned R8                 : 1;
    unsigned R9                 : 1;
    unsigned R10                : 1;
    unsigned R11                : 1;
    unsigned R12                : 1;
    unsigned R13                : 1;
    unsigned R14                : 1;
    unsigned R15                : 1;
    };

  struct
    {
    unsigned DAC5R8             : 1;
    unsigned DAC5R9             : 1;
    unsigned DAC5R10            : 1;
    unsigned DAC5R11            : 1;
    unsigned DAC5R12            : 1;
    unsigned DAC5R13            : 1;
    unsigned DAC5R14            : 1;
    unsigned DAC5R15            : 1;
    };
  } __DAC5REFHbits_t;

extern __at(0x059A) volatile __DAC5REFHbits_t DAC5REFHbits;

#define _DAC5REFH_REF8          0x01
#define _DAC5REFH_DAC5REF8      0x01
#define _DAC5REFH_R8            0x01
#define _DAC5REFH_DAC5R8        0x01
#define _DAC5REFH_REF9          0x02
#define _DAC5REFH_DAC5REF9      0x02
#define _DAC5REFH_R9            0x02
#define _DAC5REFH_DAC5R9        0x02
#define _DAC5REFH_REF10         0x04
#define _DAC5REFH_DAC5REF10     0x04
#define _DAC5REFH_R10           0x04
#define _DAC5REFH_DAC5R10       0x04
#define _DAC5REFH_REF11         0x08
#define _DAC5REFH_DAC5REF11     0x08
#define _DAC5REFH_R11           0x08
#define _DAC5REFH_DAC5R11       0x08
#define _DAC5REFH_REF12         0x10
#define _DAC5REFH_DAC5REF12     0x10
#define _DAC5REFH_R12           0x10
#define _DAC5REFH_DAC5R12       0x10
#define _DAC5REFH_REF13         0x20
#define _DAC5REFH_DAC5REF13     0x20
#define _DAC5REFH_R13           0x20
#define _DAC5REFH_DAC5R13       0x20
#define _DAC5REFH_REF14         0x40
#define _DAC5REFH_DAC5REF14     0x40
#define _DAC5REFH_R14           0x40
#define _DAC5REFH_DAC5R14       0x40
#define _DAC5REFH_REF15         0x80
#define _DAC5REFH_DAC5REF15     0x80
#define _DAC5REFH_R15           0x80
#define _DAC5REFH_DAC5R15       0x80

//==============================================================================


//==============================================================================
//        DAC6CON0 Bits

extern __at(0x059B) __sfr DAC6CON0;

typedef union
  {
  struct
    {
    unsigned NSS0               : 1;
    unsigned NSS1               : 1;
    unsigned PSS0               : 1;
    unsigned PSS1               : 1;
    unsigned OE2                : 1;
    unsigned OE1                : 1;
    unsigned FM                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned DACNSS0            : 1;
    unsigned DACNSS1            : 1;
    unsigned DACPSS0            : 1;
    unsigned DACPSS1            : 1;
    unsigned DACOE2             : 1;
    unsigned OE                 : 1;
    unsigned DACFM              : 1;
    unsigned DACEN              : 1;
    };

  struct
    {
    unsigned DAC6NSS0           : 1;
    unsigned DAC6NSS1           : 1;
    unsigned DAC6PSS0           : 1;
    unsigned DAC6PSS1           : 1;
    unsigned DAC6OE2            : 1;
    unsigned DACOE1             : 1;
    unsigned DAC6FM             : 1;
    unsigned DAC6EN             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DACOE              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DAC6OE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DACNSS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned DAC6NSS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned NSS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DAC6PSS            : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS                : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DACPSS             : 2;
    unsigned                    : 4;
    };
  } __DAC6CON0bits_t;

extern __at(0x059B) volatile __DAC6CON0bits_t DAC6CON0bits;

