OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1779.h
#define _DAC7CON1_DACR0         0x01
#define _DAC7CON1_R0            0x01
#define _DAC7CON1_DAC7R0        0x01
#define _DAC7CON1_REF0          0x01
#define _DAC7CON1_DAC7REF0      0x01
#define _DAC7CON1_DACR1         0x02
#define _DAC7CON1_R1            0x02
#define _DAC7CON1_DAC7R1        0x02
#define _DAC7CON1_REF1          0x02
#define _DAC7CON1_DAC7REF1      0x02
#define _DAC7CON1_DACR2         0x04
#define _DAC7CON1_R2            0x04
#define _DAC7CON1_DAC7R2        0x04
#define _DAC7CON1_REF2          0x04
#define _DAC7CON1_DAC7REF2      0x04
#define _DAC7CON1_DACR3         0x08
#define _DAC7CON1_R3            0x08
#define _DAC7CON1_DAC7R3        0x08
#define _DAC7CON1_REF3          0x08
#define _DAC7CON1_DAC7REF3      0x08
#define _DAC7CON1_DACR4         0x10
#define _DAC7CON1_R4            0x10
#define _DAC7CON1_DAC7R4        0x10
#define _DAC7CON1_REF4          0x10
#define _DAC7CON1_DAC7REF4      0x10

//==============================================================================


//==============================================================================
//        DAC7REF Bits

extern __at(0x059F) __sfr DAC7REF;

typedef union
  {
  struct
    {
    unsigned DACR0              : 1;
    unsigned DACR1              : 1;
    unsigned DACR2              : 1;
    unsigned DACR3              : 1;
    unsigned DACR4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7R0             : 1;
    unsigned DAC7R1             : 1;
    unsigned DAC7R2             : 1;
    unsigned DAC7R3             : 1;
    unsigned DAC7R4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7REF0           : 1;
    unsigned DAC7REF1           : 1;
    unsigned DAC7REF2           : 1;
    unsigned DAC7REF3           : 1;
    unsigned DAC7REF4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7REF            : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned REF                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned R                  : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DACR               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC7R              : 5;
    unsigned                    : 3;
    };
  } __DAC7REFbits_t;

extern __at(0x059F) volatile __DAC7REFbits_t DAC7REFbits;

#define _DAC7REF_DACR0          0x01
#define _DAC7REF_R0             0x01
#define _DAC7REF_DAC7R0         0x01
#define _DAC7REF_REF0           0x01
#define _DAC7REF_DAC7REF0       0x01
#define _DAC7REF_DACR1          0x02
#define _DAC7REF_R1             0x02
#define _DAC7REF_DAC7R1         0x02
#define _DAC7REF_REF1           0x02
#define _DAC7REF_DAC7REF1       0x02
#define _DAC7REF_DACR2          0x04
#define _DAC7REF_R2             0x04
#define _DAC7REF_DAC7R2         0x04
#define _DAC7REF_REF2           0x04
#define _DAC7REF_DAC7REF2       0x04
#define _DAC7REF_DACR3          0x08
#define _DAC7REF_R3             0x08
#define _DAC7REF_DAC7R3         0x08
#define _DAC7REF_REF3           0x08
#define _DAC7REF_DAC7REF3       0x08
#define _DAC7REF_DACR4          0x10
#define _DAC7REF_R4             0x10
#define _DAC7REF_DAC7R4         0x10
#define _DAC7REF_REF4           0x10
#define _DAC7REF_DAC7REF4       0x10

//==============================================================================


//==============================================================================
//        DAC8CON0 Bits

extern __at(0x060C) __sfr DAC8CON0;

typedef union
  {
  struct
    {
    unsigned NSS0               : 1;
    unsigned NSS1               : 1;
    unsigned PSS0               : 1;
    unsigned PSS1               : 1;
    unsigned OE2                : 1;
    unsigned OE1                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned DACNSS0            : 1;
    unsigned DACNSS1            : 1;
    unsigned DACPSS0            : 1;
    unsigned DACPSS1            : 1;
    unsigned DACOE2             : 1;
    unsigned DACOE1             : 1;
    unsigned                    : 1;
    unsigned DACEN              : 1;
    };

  struct
    {
    unsigned DAC8NSS0           : 1;
    unsigned DAC8NSS1           : 1;
    unsigned DAC8PSS0           : 1;
    unsigned DAC8PSS1           : 1;
    unsigned DAC8OE2            : 1;
    unsigned DAC8OE1            : 1;
    unsigned                    : 1;
    unsigned DAC8EN             : 1;
    };

  struct
    {
    unsigned NSS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned DACNSS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned DAC8NSS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DACPSS             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS                : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DAC8PSS            : 2;
    unsigned                    : 4;
    };
  } __DAC8CON0bits_t;

extern __at(0x060C) volatile __DAC8CON0bits_t DAC8CON0bits;

#define _DAC8CON0_NSS0          0x01
#define _DAC8CON0_DACNSS0       0x01
#define _DAC8CON0_DAC8NSS0      0x01
#define _DAC8CON0_NSS1          0x02
#define _DAC8CON0_DACNSS1       0x02
#define _DAC8CON0_DAC8NSS1      0x02
#define _DAC8CON0_PSS0          0x04
#define _DAC8CON0_DACPSS0       0x04
#define _DAC8CON0_DAC8PSS0      0x04
#define _DAC8CON0_PSS1          0x08
#define _DAC8CON0_DACPSS1       0x08
#define _DAC8CON0_DAC8PSS1      0x08
#define _DAC8CON0_OE2           0x10
#define _DAC8CON0_DACOE2        0x10
#define _DAC8CON0_DAC8OE2       0x10
#define _DAC8CON0_OE1           0x20
#define _DAC8CON0_DACOE1        0x20
#define _DAC8CON0_DAC8OE1       0x20
#define _DAC8CON0_EN            0x80
#define _DAC8CON0_DACEN         0x80
#define _DAC8CON0_DAC8EN        0x80

//==============================================================================


//==============================================================================
//        DAC8CON1 Bits

extern __at(0x060D) __sfr DAC8CON1;

typedef union
  {
  struct
    {
    unsigned DACR0              : 1;
    unsigned DACR1              : 1;
    unsigned DACR2              : 1;
    unsigned DACR3              : 1;
    unsigned DACR4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC8R0             : 1;
    unsigned DAC8R1             : 1;
    unsigned DAC8R2             : 1;
    unsigned DAC8R3             : 1;
    unsigned DAC8R4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC8REF0           : 1;
    unsigned DAC8REF1           : 1;
    unsigned DAC8REF2           : 1;
    unsigned DAC8REF3           : 1;
    unsigned DAC8REF4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned R                  : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned REF                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC8REF            : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC8R              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DACR               : 5;
    unsigned                    : 3;
    };
  } __DAC8CON1bits_t;

extern __at(0x060D) volatile __DAC8CON1bits_t DAC8CON1bits;

#define _DAC8CON1_DACR0         0x01
#define _DAC8CON1_R0            0x01
#define _DAC8CON1_DAC8R0        0x01
#define _DAC8CON1_REF0          0x01
#define _DAC8CON1_DAC8REF0      0x01
#define _DAC8CON1_DACR1         0x02
#define _DAC8CON1_R1            0x02
#define _DAC8CON1_DAC8R1        0x02
#define _DAC8CON1_REF1          0x02
#define _DAC8CON1_DAC8REF1      0x02
#define _DAC8CON1_DACR2         0x04
#define _DAC8CON1_R2            0x04
#define _DAC8CON1_DAC8R2        0x04
#define _DAC8CON1_REF2          0x04
#define _DAC8CON1_DAC8REF2      0x04
#define _DAC8CON1_DACR3         0x08
#define _DAC8CON1_R3            0x08
#define _DAC8CON1_DAC8R3        0x08
#define _DAC8CON1_REF3          0x08
#define _DAC8CON1_DAC8REF3      0x08
#define _DAC8CON1_DACR4         0x10
#define _DAC8CON1_R4            0x10
#define _DAC8CON1_DAC8R4        0x10
#define _DAC8CON1_REF4          0x10
#define _DAC8CON1_DAC8REF4      0x10

//==============================================================================


//==============================================================================
//        DAC8REF Bits

