OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1779.h
extern __at(0x0817) volatile __COG3RSIM0bits_t COG3RSIM0bits;

#define _COG3RSIM0_RSIM0        0x01
#define _COG3RSIM0_G3RSIM0      0x01
#define _COG3RSIM0_RSIM1        0x02
#define _COG3RSIM0_G3RSIM1      0x02
#define _COG3RSIM0_RSIM2        0x04
#define _COG3RSIM0_G3RSIM2      0x04
#define _COG3RSIM0_RSIM3        0x08
#define _COG3RSIM0_G3RSIM3      0x08
#define _COG3RSIM0_RSIM4        0x10
#define _COG3RSIM0_G3RSIM4      0x10
#define _COG3RSIM0_RSIM5        0x20
#define _COG3RSIM0_G3RSIM5      0x20
#define _COG3RSIM0_RSIM6        0x40
#define _COG3RSIM0_G3RSIM6      0x40
#define _COG3RSIM0_RSIM7        0x80
#define _COG3RSIM0_G3RSIM7      0x80

//==============================================================================


//==============================================================================
//        COG3RSIM1 Bits

extern __at(0x0818) __sfr COG3RSIM1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned RSIM9              : 1;
    unsigned                    : 1;
    unsigned RSIM11             : 1;
    unsigned RSIM12             : 1;
    unsigned RSIM13             : 1;
    unsigned RSIM14             : 1;
    unsigned RSIM15             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned G3RSIM9            : 1;
    unsigned                    : 1;
    unsigned G3RSIM11           : 1;
    unsigned G3RSIM12           : 1;
    unsigned G3RSIM13           : 1;
    unsigned G3RSIM14           : 1;
    unsigned G3RSIM15           : 1;
    };
  } __COG3RSIM1bits_t;

extern __at(0x0818) volatile __COG3RSIM1bits_t COG3RSIM1bits;

#define _COG3RSIM1_RSIM9        0x02
#define _COG3RSIM1_G3RSIM9      0x02
#define _COG3RSIM1_RSIM11       0x08
#define _COG3RSIM1_G3RSIM11     0x08
#define _COG3RSIM1_RSIM12       0x10
#define _COG3RSIM1_G3RSIM12     0x10
#define _COG3RSIM1_RSIM13       0x20
#define _COG3RSIM1_G3RSIM13     0x20
#define _COG3RSIM1_RSIM14       0x40
#define _COG3RSIM1_G3RSIM14     0x40
#define _COG3RSIM1_RSIM15       0x80
#define _COG3RSIM1_G3RSIM15     0x80

//==============================================================================


//==============================================================================
//        COG3FIS0 Bits

extern __at(0x0819) __sfr COG3FIS0;

typedef union
  {
  struct
    {
    unsigned FIS0               : 1;
    unsigned FIS1               : 1;
    unsigned FIS2               : 1;
    unsigned FIS3               : 1;
    unsigned FIS4               : 1;
    unsigned FIS5               : 1;
    unsigned FIS6               : 1;
    unsigned FIS7               : 1;
    };

  struct
    {
    unsigned G3FIS0             : 1;
    unsigned G3FIS1             : 1;
    unsigned G3FIS2             : 1;
    unsigned G3FIS3             : 1;
    unsigned G3FIS4             : 1;
    unsigned G3FIS5             : 1;
    unsigned G3FIS6             : 1;
    unsigned G3FIS7             : 1;
    };
  } __COG3FIS0bits_t;

extern __at(0x0819) volatile __COG3FIS0bits_t COG3FIS0bits;

#define _COG3FIS0_FIS0          0x01
#define _COG3FIS0_G3FIS0        0x01
#define _COG3FIS0_FIS1          0x02
#define _COG3FIS0_G3FIS1        0x02
#define _COG3FIS0_FIS2          0x04
#define _COG3FIS0_G3FIS2        0x04
#define _COG3FIS0_FIS3          0x08
#define _COG3FIS0_G3FIS3        0x08
#define _COG3FIS0_FIS4          0x10
#define _COG3FIS0_G3FIS4        0x10
#define _COG3FIS0_FIS5          0x20
#define _COG3FIS0_G3FIS5        0x20
#define _COG3FIS0_FIS6          0x40
#define _COG3FIS0_G3FIS6        0x40
#define _COG3FIS0_FIS7          0x80
#define _COG3FIS0_G3FIS7        0x80

//==============================================================================


//==============================================================================
//        COG3FIS1 Bits

extern __at(0x081A) __sfr COG3FIS1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned FIS9               : 1;
    unsigned                    : 1;
    unsigned FIS11              : 1;
    unsigned FIS12              : 1;
    unsigned FIS13              : 1;
    unsigned FIS14              : 1;
    unsigned FIS15              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned G3FIS9             : 1;
    unsigned                    : 1;
    unsigned G3FIS11            : 1;
    unsigned G3FIS12            : 1;
    unsigned G3FIS13            : 1;
    unsigned G3FIS14            : 1;
    unsigned G3FIS15            : 1;
    };
  } __COG3FIS1bits_t;

extern __at(0x081A) volatile __COG3FIS1bits_t COG3FIS1bits;

#define _COG3FIS1_FIS9          0x02
#define _COG3FIS1_G3FIS9        0x02
#define _COG3FIS1_FIS11         0x08
#define _COG3FIS1_G3FIS11       0x08
#define _COG3FIS1_FIS12         0x10
#define _COG3FIS1_G3FIS12       0x10
#define _COG3FIS1_FIS13         0x20
#define _COG3FIS1_G3FIS13       0x20
#define _COG3FIS1_FIS14         0x40
#define _COG3FIS1_G3FIS14       0x40
#define _COG3FIS1_FIS15         0x80
#define _COG3FIS1_G3FIS15       0x80

//==============================================================================


//==============================================================================
//        COG3FSIM0 Bits

extern __at(0x081B) __sfr COG3FSIM0;

typedef union
  {
  struct
    {
    unsigned FSIM0              : 1;
    unsigned FSIM1              : 1;
    unsigned FSIM2              : 1;
    unsigned FSIM3              : 1;
    unsigned FSIM4              : 1;
    unsigned FSIM5              : 1;
    unsigned FSIM6              : 1;
    unsigned FSIM7              : 1;
    };

  struct
    {
    unsigned G3FSIM0            : 1;
    unsigned G3FSIM1            : 1;
    unsigned G3FSIM2            : 1;
    unsigned G3FSIM3            : 1;
    unsigned G3FSIM4            : 1;
    unsigned G3FSIM5            : 1;
    unsigned G3FSIM6            : 1;
    unsigned G3FSIM7            : 1;
    };
  } __COG3FSIM0bits_t;

extern __at(0x081B) volatile __COG3FSIM0bits_t COG3FSIM0bits;

#define _COG3FSIM0_FSIM0        0x01
#define _COG3FSIM0_G3FSIM0      0x01
#define _COG3FSIM0_FSIM1        0x02
#define _COG3FSIM0_G3FSIM1      0x02
#define _COG3FSIM0_FSIM2        0x04
#define _COG3FSIM0_G3FSIM2      0x04
#define _COG3FSIM0_FSIM3        0x08
#define _COG3FSIM0_G3FSIM3      0x08
#define _COG3FSIM0_FSIM4        0x10
#define _COG3FSIM0_G3FSIM4      0x10
#define _COG3FSIM0_FSIM5        0x20
#define _COG3FSIM0_G3FSIM5      0x20
#define _COG3FSIM0_FSIM6        0x40
#define _COG3FSIM0_G3FSIM6      0x40
#define _COG3FSIM0_FSIM7        0x80
#define _COG3FSIM0_G3FSIM7      0x80

//==============================================================================


//==============================================================================
//        COG3FSIM1 Bits

extern __at(0x081C) __sfr COG3FSIM1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned FSIM9              : 1;
    unsigned                    : 1;
    unsigned FSIM11             : 1;
    unsigned FSIM12             : 1;
    unsigned FSIM13             : 1;
    unsigned FSIM14             : 1;
    unsigned FSIM15             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned G3FSIM9            : 1;
    unsigned                    : 1;
    unsigned G3FSIM11           : 1;
    unsigned G3FSIM12           : 1;
    unsigned G3FSIM13           : 1;
    unsigned G3FSIM14           : 1;
    unsigned G3FSIM15           : 1;
    };
  } __COG3FSIM1bits_t;

extern __at(0x081C) volatile __COG3FSIM1bits_t COG3FSIM1bits;

