OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1779.h
extern __at(0x088D) __sfr COG4PHR;

typedef union
  {
  struct
    {
    unsigned PHR0               : 1;
    unsigned PHR1               : 1;
    unsigned PHR2               : 1;
    unsigned PHR3               : 1;
    unsigned PHR4               : 1;
    unsigned PHR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4PHR0             : 1;
    unsigned G4PHR1             : 1;
    unsigned G4PHR2             : 1;
    unsigned G4PHR3             : 1;
    unsigned G4PHR4             : 1;
    unsigned G4PHR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4PHR              : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned PHR                : 6;
    unsigned                    : 2;
    };
  } __COG4PHRbits_t;

extern __at(0x088D) volatile __COG4PHRbits_t COG4PHRbits;

#define _COG4PHR_PHR0           0x01
#define _COG4PHR_G4PHR0         0x01
#define _COG4PHR_PHR1           0x02
#define _COG4PHR_G4PHR1         0x02
#define _COG4PHR_PHR2           0x04
#define _COG4PHR_G4PHR2         0x04
#define _COG4PHR_PHR3           0x08
#define _COG4PHR_G4PHR3         0x08
#define _COG4PHR_PHR4           0x10
#define _COG4PHR_G4PHR4         0x10
#define _COG4PHR_PHR5           0x20
#define _COG4PHR_G4PHR5         0x20

//==============================================================================


//==============================================================================
//        COG4PHF Bits

extern __at(0x088E) __sfr COG4PHF;

typedef union
  {
  struct
    {
    unsigned PHF0               : 1;
    unsigned PHF1               : 1;
    unsigned PHF2               : 1;
    unsigned PHF3               : 1;
    unsigned PHF4               : 1;
    unsigned PHF5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4PHF0             : 1;
    unsigned G4PHF1             : 1;
    unsigned G4PHF2             : 1;
    unsigned G4PHF3             : 1;
    unsigned G4PHF4             : 1;
    unsigned G4PHF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PHF                : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G4PHF              : 6;
    unsigned                    : 2;
    };
  } __COG4PHFbits_t;

extern __at(0x088E) volatile __COG4PHFbits_t COG4PHFbits;

#define _COG4PHF_PHF0           0x01
#define _COG4PHF_G4PHF0         0x01
#define _COG4PHF_PHF1           0x02
#define _COG4PHF_G4PHF1         0x02
#define _COG4PHF_PHF2           0x04
#define _COG4PHF_G4PHF2         0x04
#define _COG4PHF_PHF3           0x08
#define _COG4PHF_G4PHF3         0x08
#define _COG4PHF_PHF4           0x10
#define _COG4PHF_G4PHF4         0x10
#define _COG4PHF_PHF5           0x20
#define _COG4PHF_G4PHF5         0x20

//==============================================================================


//==============================================================================
//        COG4BLKR Bits

extern __at(0x088F) __sfr COG4BLKR;

typedef union
  {
  struct
    {
    unsigned BLKR0              : 1;
    unsigned BLKR1              : 1;
    unsigned BLKR2              : 1;
    unsigned BLKR3              : 1;
    unsigned BLKR4              : 1;
    unsigned BLKR5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4BLKR0            : 1;
    unsigned G4BLKR1            : 1;
    unsigned G4BLKR2            : 1;
    unsigned G4BLKR3            : 1;
    unsigned G4BLKR4            : 1;
    unsigned G4BLKR5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BLKR               : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G4BLKR             : 6;
    unsigned                    : 2;
    };
  } __COG4BLKRbits_t;

extern __at(0x088F) volatile __COG4BLKRbits_t COG4BLKRbits;

#define _COG4BLKR_BLKR0         0x01
#define _COG4BLKR_G4BLKR0       0x01
#define _COG4BLKR_BLKR1         0x02
#define _COG4BLKR_G4BLKR1       0x02
#define _COG4BLKR_BLKR2         0x04
#define _COG4BLKR_G4BLKR2       0x04
#define _COG4BLKR_BLKR3         0x08
#define _COG4BLKR_G4BLKR3       0x08
#define _COG4BLKR_BLKR4         0x10
#define _COG4BLKR_G4BLKR4       0x10
#define _COG4BLKR_BLKR5         0x20
#define _COG4BLKR_G4BLKR5       0x20

//==============================================================================


//==============================================================================
//        COG4BLKF Bits

extern __at(0x0890) __sfr COG4BLKF;

typedef union
  {
  struct
    {
    unsigned BLKF0              : 1;
    unsigned BLKF1              : 1;
    unsigned BLKF2              : 1;
    unsigned BLKF3              : 1;
    unsigned BLKF4              : 1;
    unsigned BLKF5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4BLKF0            : 1;
    unsigned G4BLKF1            : 1;
    unsigned G4BLKF2            : 1;
    unsigned G4BLKF3            : 1;
    unsigned G4BLKF4            : 1;
    unsigned G4BLKF5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4BLKF             : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned BLKF               : 6;
    unsigned                    : 2;
    };
  } __COG4BLKFbits_t;

extern __at(0x0890) volatile __COG4BLKFbits_t COG4BLKFbits;

#define _COG4BLKF_BLKF0         0x01
#define _COG4BLKF_G4BLKF0       0x01
#define _COG4BLKF_BLKF1         0x02
#define _COG4BLKF_G4BLKF1       0x02
#define _COG4BLKF_BLKF2         0x04
#define _COG4BLKF_G4BLKF2       0x04
#define _COG4BLKF_BLKF3         0x08
#define _COG4BLKF_G4BLKF3       0x08
#define _COG4BLKF_BLKF4         0x10
#define _COG4BLKF_G4BLKF4       0x10
#define _COG4BLKF_BLKF5         0x20
#define _COG4BLKF_G4BLKF5       0x20

//==============================================================================


//==============================================================================
//        COG4DBR Bits

