OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1779.h
#define _MD4CON1_CLSYNC         0x01
#define _MD4CON1_MD4CLSYNC      0x01
#define _MD4CON1_CLPOL          0x02
#define _MD4CON1_MD4CLPOL       0x02
#define _MD4CON1_CHSYNC         0x10
#define _MD4CON1_MD4CHSYNC      0x10
#define _MD4CON1_CHPOL          0x20
#define _MD4CON1_MD4CHPOL       0x20

//==============================================================================


//==============================================================================
//        MD4SRC Bits

extern __at(0x0D1D) __sfr MD4SRC;

typedef union
  {
  struct
    {
    unsigned MS0                : 1;
    unsigned MS1                : 1;
    unsigned MS2                : 1;
    unsigned MS3                : 1;
    unsigned MS4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD4MS0             : 1;
    unsigned MD4MS1             : 1;
    unsigned MD4MS2             : 1;
    unsigned MD4MS3             : 1;
    unsigned MD4MS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD4MS              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned MS                 : 5;
    unsigned                    : 3;
    };
  } __MD4SRCbits_t;

extern __at(0x0D1D) volatile __MD4SRCbits_t MD4SRCbits;

#define _MD4SRC_MS0             0x01
#define _MD4SRC_MD4MS0          0x01
#define _MD4SRC_MS1             0x02
#define _MD4SRC_MD4MS1          0x02
#define _MD4SRC_MS2             0x04
#define _MD4SRC_MD4MS2          0x04
#define _MD4SRC_MS3             0x08
#define _MD4SRC_MD4MS3          0x08
#define _MD4SRC_MS4             0x10
#define _MD4SRC_MD4MS4          0x10

//==============================================================================


//==============================================================================
//        MD4CARL Bits

extern __at(0x0D1E) __sfr MD4CARL;

typedef union
  {
  struct
    {
    unsigned CL0                : 1;
    unsigned CL1                : 1;
    unsigned CL2                : 1;
    unsigned CL3                : 1;
    unsigned CL4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD4CL0             : 1;
    unsigned MD4CL1             : 1;
    unsigned MD4CL2             : 1;
    unsigned MD4CL3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD4CL              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CL                 : 5;
    unsigned                    : 3;
    };
  } __MD4CARLbits_t;

extern __at(0x0D1E) volatile __MD4CARLbits_t MD4CARLbits;

#define _MD4CARL_CL0            0x01
#define _MD4CARL_MD4CL0         0x01
#define _MD4CARL_CL1            0x02
#define _MD4CARL_MD4CL1         0x02
#define _MD4CARL_CL2            0x04
#define _MD4CARL_MD4CL2         0x04
#define _MD4CARL_CL3            0x08
#define _MD4CARL_MD4CL3         0x08
#define _MD4CARL_CL4            0x10

//==============================================================================


//==============================================================================
//        MD4CARH Bits

extern __at(0x0D1F) __sfr MD4CARH;

typedef union
  {
  struct
    {
    unsigned CH0                : 1;
    unsigned CH1                : 1;
    unsigned CH2                : 1;
    unsigned CH3                : 1;
    unsigned CH4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD4CH0             : 1;
    unsigned MD4CH1             : 1;
    unsigned MD4CH2             : 1;
    unsigned MD4CH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CH                 : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned MD4CH              : 4;
    unsigned                    : 4;
    };
  } __MD4CARHbits_t;

extern __at(0x0D1F) volatile __MD4CARHbits_t MD4CARHbits;

#define _MD4CARH_CH0            0x01
#define _MD4CARH_MD4CH0         0x01
#define _MD4CARH_CH1            0x02
#define _MD4CARH_MD4CH1         0x02
#define _MD4CARH_CH2            0x04
#define _MD4CARH_MD4CH2         0x04
#define _MD4CARH_CH3            0x08
#define _MD4CARH_MD4CH3         0x08
#define _MD4CARH_CH4            0x10

//==============================================================================


//==============================================================================
//        PWMEN Bits

extern __at(0x0D8E) __sfr PWMEN;

typedef struct
  {
  unsigned MPWM5EN              : 1;
  unsigned MPWM6EN              : 1;
  unsigned MPWM11EN             : 1;
  unsigned MPWM12EN             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMENbits_t;

extern __at(0x0D8E) volatile __PWMENbits_t PWMENbits;

#define _MPWM5EN                0x01
#define _MPWM6EN                0x02
#define _MPWM11EN               0x04
#define _MPWM12EN               0x08

//==============================================================================


//==============================================================================
//        PWMLD Bits

extern __at(0x0D8F) __sfr PWMLD;

typedef struct
  {
  unsigned MPWM5LD              : 1;
  unsigned MPWM6LD              : 1;
  unsigned MPWM11LD             : 1;
  unsigned MPWM12LD             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMLDbits_t;

extern __at(0x0D8F) volatile __PWMLDbits_t PWMLDbits;

#define _MPWM5LD                0x01
#define _MPWM6LD                0x02
#define _MPWM11LD               0x04
#define _MPWM12LD               0x08

//==============================================================================


//==============================================================================
//        PWMOUT Bits

extern __at(0x0D90) __sfr PWMOUT;

typedef struct
  {
  unsigned MPWM5OUT             : 1;
  unsigned MPWM6OUT             : 1;
  unsigned MPWM11OUT            : 1;
  unsigned MPWM12OUT            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMOUTbits_t;

extern __at(0x0D90) volatile __PWMOUTbits_t PWMOUTbits;

